app/controllers/students_controller.rb

  def index
    @name = Student.all.map do |student|
---
SELECT "students".* FROM "students"